# FittingAnnotationSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSettings..::..FittingAnnotationSize Property
ConduitSettings Class See Also
---
The value of fitting annotation size.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double FittingAnnotationSize { get; set; }
```

Visual Basic
---
```text
Public Property FittingAnnotationSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FittingAnnotationSize {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for fittingAnnotationSize must be between 0 and 30000 feet. |

# See Also
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace